<template>
  <div class="types-page">
    <v-tabs-items v-model="currentTypesTab">
      <v-tab-item>
        <v-card flat>
          <v-card-text>
            <p>Растениеводство</p>
            <p>
              В борьбе с хозяйственно опасными вредителями, болезнями растений,
              при гербицидных обработках, десикации и внекорневой подкормке,
              мобильная установка ГАРД® не имеет равных по эффективности,
              производительности и минимальному воздействию на окружающую среду.
              Универсальность генератора ГАРД® позволяет использовать его
              практически во всех технологиях внесения химических и
              биологических препаратов в сельском хозяйстве.
            </p>

            <p>
              Самое востребованное направление в использовании аэрозольной
              технологии ГАРД® - борьба с нашествием опасных насекомых, таких
              как саранча и луговой мотылек, при которой важно в кратчайшие
              сроки охватить огромные территории. Установки ГАРД® успешно
              применяются в борьбе с саранчой в Республике Башкортостан,
              Оренбургской области и в Республике Казахстан. Эффективность
              обработок достигает 98%, что подтверждается Башкирским
              научно-исследовательским институтом сельского хозяйства.
              Максимальная сменная производительность ГАРД® - до 2000 га. Это в
              5 раз выше, чем у авиационных и в 10 раз выше, чем у штанговых
              наземных опрыскивателей. При этом значительно сокращаются
              трудозатраты на подвоз воды и заправку рабочей жидкостью.
              Установка ГАРД® работает в вечернее и ночное время, когда
              воздействие на большинство полезных для человека насекомых
              минимально.
            </p>

            <p>
              Такие технологические характеристики установки ГАРД®, как большая
              ширина захвата, высокая производительность, низкий расход рабочей
              жидкости существенно облегчают и ускоряют проведение защитных
              мероприятий, а так же значительно сокращают затраты, в том числе и
              из-за соответствия агротехнических сроков.
            </p>
          </v-card-text>
        </v-card>
      </v-tab-item>

      <v-tab-item>
        <v-card flat>
          <v-card-text>
            <p>Животноводство и птицеводство</p>
            <p>
              Дезинфекция помещений - уничтожение вредных микроорганизмов.
              Мероприятия по дезинфекции помещений направлены на уничтожение
              возбудителей инфекционных заболеваний. Дезинфекционная обработка
              проводится как для профилактики, так и с целью уничтожения
              микроорганизмов или токсичных и аллергенных продуктов их
              жизнедеятельности.
            </p>
            <p>
              Актуальность медицинской дезинфекции обусловлена важностью
              осуществления неспецифической профилактики инфекционных болезней ,
              в т.ч. новых и вновь возвращающихся инфекций. Кроме того,
              возрастает роль и значение проведения масштабных дезинфекционных
              мероприятий при ликвидации эпидемических очагов эпизоотий в
              животноводстве и птицеводстве. Применение высокопроизводительной
              установки ГАРД для осуществления медицинской дезинфекции является
              важнейшим звеном успеха в практической деятельности
              дезинфекционной службы.
            </p>
          </v-card-text>
        </v-card>
      </v-tab-item>

      <v-tab-item>
        <v-card flat>
          <v-card-text>
            <p>Лесное хозяйство</p>
            <p>
              Лесозащита является одним из важнейших элементов лесоводства.
              Значение мероприятий по локализации и ликвидации очагов вредных
              организмов трудно переоценить. Особенно остро встает вопрос о
              надежной защите лесных насаждений в лесостепной зоне от
              повреждений вредными насекомыми, которые наносят лесу серьезный
              ущерб, от его ослабления до полной потери жизнеспособности и
              усыхания.
            </p>
            <p>
              Наиболее рациональной остается система защитных мероприятий,
              организованная по принципу интегрированной борьбы. При этом в
              целях наименьшего воздействия на окружающую среду учитываются
              многие факторы, связанные, как с биологией хозяйственно опасного
              организма, так и с технологией применения пестицидов.
            </p>
          </v-card-text>
        </v-card>
      </v-tab-item>

      <v-tab-item>
        <v-card flat>
          <v-card-text>
            <p>Здравоохранение</p>
            <p>
              Генераторы аэрозольные ГАРД способны проводить обработку
              территорий загородных домов, коттеджей, садов, приусадебных лесов,
              водоемов от всех кровососущих вредителей (комаров, клещей,
              мошкары), а также ос. Обработки проводятся без причинения вреда
              людям, нецелевым животным (лесным зверям, домашним собакам, котам,
              земноводным), промысловым и декоративным рыбам, обитающим в
              приусадебных или близлежащих водоемах.
            </p>
          </v-card-text>
        </v-card>
      </v-tab-item>

      <v-tab-item>
        <v-card flat>
          <v-card-text>
            <p>МЧС</p>
            <p>
              Карантинные обработки – обработки территорий при обнаружении на
              них карантинного вредного организма. Карантинный вредный организм
              (в карантине растений) – согласно законодательству РФ, это вредный
              организм, отсутствующий или ограниченно распространенный на
              территории Российской Федерации; при этом под вредным организмом
              понимается растение любого вида, сорта или биологического типа,
              животное или болезнетворный организм любого вида, расы,
              биологического типа, способные нанести вред растениям или
              продукции растительного происхождения.
            </p>
          </v-card-text>
        </v-card>
      </v-tab-item>
    </v-tabs-items>
  </div>
</template>

<script>
import { mapGetters } from "vuex";
export default {
  name: "Types",
  data() {
    return {
      typesContent: [
        {
          content: `
          `,
        },
        {
          content: "Животноводство и птицеводство",
        },
        {
          content: "Лесное хозяйство",
        },
        {
          content: "Здравоохранение",
        },
        {
          content: "МЧС",
        },
      ],
    };
  },
  components: {},
  props: {
    currentTypesTab: {
      type: Number,
      default: 0,
    },
  },
  computed: {
    ...mapGetters(["typesCurrentTab", "typesTabs"]),
  },
};
</script>

<style lang="scss" scoped>
.theme--light.v-card,
.theme--light.v-tabs-items {
  background: transparent;
}
</style>